# LegacyShapefileImp

## Description
Use the old UI to import files.

```pascal
PROCEDURE LegacyShapefileImp;
```

```python
def vs.LegacyShapefileImp():
    return None
```

## Examples
```pascal
LegacyShapefileImp;
```
```python
import vs

# Use the old UI to import files.
vs.LegacyShapefileImp()
```

## Version
Availability: from Vectorworks 2012

## Category
* GIS